➜ make build_twisty
rm -f ExploreTheTwistyLabyrinth.exe
g++ -g -std=c++11 -Wall ExploreTheTwistyLabyrinth.cpp -o ExploreTheTwistyLabyrinth.exe
➜ make run_twisty
./ExploreTheTwistyLabyrinth.exe
You have not escaped!
➜ gdb ExploreTheTwistyLabyrinth.exe
GNU gdb (Ubuntu 15.0.50.20240403-0ubuntu1) 15.0.50.20240403-git
Copyright (C) 2024 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ExploreTheTwistyLabyrinth.exe...
(gdb) b ExploreTheTwistyLabyrinth.cpp:15
Breakpoint 1 at 0x29b4: file ExploreTheTwistyLabyrinth.cpp, line 18.
(gdb) r
Starting program: /usercode/ExploreTheTwistyLabyrinth.exe 
warning: Error disabling address space randomization: Operation not permitted
[Thread debugging using libthread_db enabled]
Using host libthread_db library "/lib/x86_64-linux-gnu/libthread_db.so.1".

Breakpoint 1, main () at ExploreTheTwistyLabyrinth.cpp:18
18          if (isPathToFreedom(start, kPathOutOfTwistyMaze)) {
(gdb) p *start
$1 = {whatsHere = "", north = 0x60d75956bc80, south = 0x0, 
  east = 0x60d75956bd70, west = 0x0}
(gdb) p * (start->east)
$2 = {whatsHere = "", north = 0x0, south = 0x60d75956bd20, 
  east = 0x60d75956b430, west = 0x0}
(gdb) p * (start->east->east)
$3 = {whatsHere = "", north = 0x60d75956bc80, south = 0x0, 
  east = 0x60d75956bd70, west = 0x0}
(gdb) p * (start->east->east->north)
$4 = {whatsHere = "", north = 0x60d75956b430, south = 0x60d75956bb20, 
  east = 0x0, west = 0x60d75956bb90}
(gdb) p * (start->east->east->north->west)
$5 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x60d75956bc30, 
  west = 0x60d75956bc80}
(gdb) p * (start->east->east->north->west->east)
$6 = {whatsHere = "Spellbook", north = 0x0, south = 0x0, 
  east = 0x60d75956bb90, west = 0x0}
(gdb) p * (start->east->east->north->west->east->east)
$7 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x60d75956bc30, 
  west = 0x60d75956bc80}
(gdb) p * (start->east->east->north->west->east->east->west)
$8 = {whatsHere = "", north = 0x60d75956b430, south = 0x60d75956bb20, 
  east = 0x0, west = 0x60d75956bb90}
(gdb) p * (start->east->east->north->west->east->east->west->west)
$9 = {whatsHere = "", north = 0x0, south = 0x0, east = 0x60d75956bc30, 
  west = 0x60d75956bc80}
(gdb) p * (start->east->east->north->west->east->east->west->west->west)
$10 = {whatsHere = "", north = 0x60d75956b430, south = 0x60d75956bb20, 
  east = 0x0, west = 0x60d75956bb90}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south)
$11 = {whatsHere = "", north = 0x0, south = 0x60d75956bbe0, 
  east = 0x60d75956bdc0, west = 0x60d75956bc80}                                                                                              >east) p * (start->east->east->north->west->east->east->west->west->west->south-) 
$12 = {whatsHere = "", north = 0x60d75956bb20, south = 0x0, 
  east = 0x60d75956bef0, west = 0x0}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east)
$13 = {whatsHere = "Wand", north = 0x0, south = 0x0, east = 0x60d75956bdc0, 
  west = 0x0}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east)
$14 = {whatsHere = "", north = 0x60d75956bb20, south = 0x0, 
  east = 0x60d75956bef0, west = 0x0}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north)
$15 = {whatsHere = "", north = 0x0, south = 0x60d75956bbe0, 
  east = 0x60d75956bdc0, west = 0x60d75956bc80}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south)
$16 = {whatsHere = "", north = 0x60d75956bb20, south = 0x0, east = 0x0, 
  west = 0x0}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south->north)
$17 = {whatsHere = "", north = 0x0, south = 0x60d75956bbe0, 
  east = 0x60d75956bdc0, west = 0x60d75956bc80}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south->north->west)
$18 = {whatsHere = "", north = 0x60d75956b430, south = 0x60d75956bb20, 
  east = 0x0, west = 0x60d75956bb90}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south->north->west->north)
$19 = {whatsHere = "", north = 0x60d75956bc80, south = 0x0, 
  east = 0x60d75956bd70, west = 0x0}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south->north->west->north->east)
$20 = {whatsHere = "", north = 0x0, south = 0x60d75956bd20, 
  east = 0x60d75956b430, west = 0x0}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south->north->west->north->east->soh)
$21 = {whatsHere = "", north = 0x60d75956bcd0, south = 0x0, east = 0x0, 
  west = 0x60d75956bd70}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south->north->west->north->east->south->north)
$22 = {whatsHere = "", north = 0x60d75956bd20, south = 0x0, east = 0x0, 
  west = 0x60d75956bea0}
(gdb) p * (start->east->east->north->west->east->east->west->west->west->south->east->east->east->north->south->north->west->north->east->south->north->west)
$23 = {whatsHere = "Potion", north = 0x0, south = 0x0, east = 0x0, 
  west = 0x60d75956bcd0}
(gdb) 

